<?xml version="1.0" encoding="utf-8" standalone="yes"?><rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom"><channel><title>Life on wd and cc</title><link>https://wdicc.com/tags/life/</link><description>Recent content in Life on wd and cc</description><generator>Hugo</generator><language>zh-CN</language><lastBuildDate>Sat, 07 Oct 2017 18:10:00 +0800</lastBuildDate><atom:link href="https://wdicc.com/tags/life/atom.xml" rel="self" type="application/rss+xml"/><item><title>生生死死《白鹿原》</title><link>https://wdicc.com/life/</link><pubDate>Sat, 07 Oct 2017 18:10:00 +0800</pubDate><guid>https://wdicc.com/life/</guid><description>之前 6 月份去上海那边的时候，偶尔看到电视里面演《白鹿原》，看了几集。吸引我的，主要可能是里面的乡土气</description></item><item><title>总结 2010</title><link>https://wdicc.com/days-in-2010/</link><pubDate>Sun, 13 Feb 2011 00:00:00 +0000</pubDate><guid>https://wdicc.com/days-in-2010/</guid><description>这都 2011 年的 2 月份了才写 2010 年的总结，好像晚了点，呵呵。不过其实这不是才过年了，还不算晚。 翻翻看 2009 年的，</description></item><item><title>2009年的最后一天</title><link>https://wdicc.com/2009/</link><pubDate>Thu, 31 Dec 2009 00:00:00 +0000</pubDate><guid>https://wdicc.com/2009/</guid><description>&amp;#26368;&amp;#21518;&amp;#19968;&amp;#22825;&amp;#20102;&amp;#65292;&amp;#20284;&amp;#20046;&amp;#24212;&amp;#35813;&amp;#20889;&amp;#20010;&amp;#24635;&amp;#32467;&amp;#30340;&amp;#65292;&amp;#33293;&amp;#19981;&amp;#24471;&amp;#28909;&amp;#34987;&amp;#31389;&amp;#65292;&amp;#25163;&amp;#26426;&amp;#23558;&amp;#23601;&amp;#26469;&amp;#19968;&amp;#20010;&amp;#21543;&amp;#12290; 2009&amp;#24180;&amp;#24037;&amp;#20316;&amp;#19978;&amp;#38754;&amp;#22909;&amp;#20687;&amp;#27809;&amp;#20160;&amp;#20040;&amp;#22909;&amp;#35828;&amp;#30340;&amp;#65292;&amp;#21807;&amp;#19968;&amp;#30340;&amp;#36827;&amp;#27493;&amp;#21487;&amp;#33021;&amp;#36824;&amp;#26159;&amp;#20889;&amp;#31243;&amp;#24207;&amp;#22909;&amp;#20687;&amp;#26356;&amp;#29087;&amp;#20102;&amp;#28857;&amp;#20102;&amp;#65292;&amp;#20854;&amp;#23454;&amp;#20063;&amp;#23601;&amp;#26159;&amp;#35266;&amp;#25705;&amp;#20102;&amp;#19968;&amp;#20010;&amp;#39640;&amp;#25163;&amp;#30340;&amp;#31243;&amp;#24207;&amp;#65292;&amp;#26412;&amp;#36523;&amp;#38271;&amp;#36827;&amp;#36824;&amp;#26159;&amp;#19981;&amp;#22823;&amp;#12290; &amp;#36890;&amp;#36807;&amp;#23545;&amp;#31038;&amp;#20250;&amp;#19978;&amp;#38754;&amp;#24694;&amp;#24515;&amp;#20107;&amp;#30340;&amp;#35266;&amp;#23519;&amp;#20102;&amp;#35299;&amp;#65292;&amp;#29616;&amp;#22312;&amp;#22909;&amp;#20687;&amp;#36234;&amp;#26469;&amp;#36234;&amp;#24868;&amp;#38738;&amp;#20102;&amp;#65292;&amp;#23545;&amp;#32463;&amp;#27982;&amp;#21644;&amp;#31038;&amp;#20250;&amp;#26041;&amp;#38754;&amp;#30340;&amp;#19996;&amp;#35199;&amp;#22909;&amp;#20687;&amp;#36234;&amp;#26469;&amp;#36234;&amp;#26377;&amp;#20852;&amp;#36259;&amp;#20102;&amp;#65292;&amp;#32769;&amp;#20102;&amp;#65311;&amp;#12290;&amp;#12290;&amp;#12290;&amp;#12290;&amp;#39034;&amp;#20415;&amp;#20877;&amp;#26174;&amp;#25670;&amp;#19968;&amp;#20010;&amp;#19978;&amp;#36807;&amp;#23398;&amp;#23601;&amp;#24212;&amp;#35813;&amp;#30693;&amp;#36947;&amp;#30340;&amp;#35789;&amp;ldquo;&amp;#22269;&amp;#23478;&amp;#22404;&amp;#26029;&amp;#36164;&amp;#26412;&amp;#20027;&amp;#20041;&amp;ldquo;&amp;#65292;&amp;#26377;&amp;#26102;&amp;#20505;&amp;#23601;&amp;#22312;&amp;#24819;&amp;#65292;&amp;#26159;&amp;#19981;&amp;#26159;&amp;#24212;&amp;#35813;&amp;#25226;&amp;#37027;&amp;#26412;&amp;#25919;&amp;#27835;&amp;#20070;&amp;#32763;&amp;#20986;&amp;#26469;&amp;#20877;&amp;#30475;&amp;#30475;&amp;#21602;&amp;#65311;&amp;#36164;&amp;#26412;&amp;#35770;&amp;#19981;&amp;#30693;&amp;#36947;&amp;#29616;&amp;#22312;&amp;#36807;&amp;#26399;&amp;#19981;&amp;#12290;&amp;#12290;&amp;#12290;&amp;#20102;&amp;#35299;&amp;#37027;&amp;#20123;&amp;#20498;&amp;#19981;&amp;#19968;&amp;#23450;&amp;#26159;&amp;#21435;&amp;#24403;&amp;#20154;&amp;#22823;&amp;#20195;&amp;#34920;&amp;#65292;&amp;#21482;&amp;#26159;&amp;#33021;&amp;#35753;&amp;#33258;&amp;#24049;&amp;#33021;&amp;#25226;&amp;#36825;&amp;#20010;&amp;#31038;&amp;#20250;&amp;#36825;&amp;#20010;&amp;#22269;&amp;#23478;&amp;#30475;&amp;#30340;&amp;#26356;&amp;#21152;&amp;#36879;&amp;#24443;&amp;#19968;&amp;#28857;&amp;#12290;&amp;#19981;&amp;#36807;&amp;#35805;&amp;#35828;&amp;#22238;&amp;#26469;&amp;#65292;&amp;#20154;&amp;#22823;&amp;#20195;&amp;#34920;&amp;#20160;&amp;#20040;&amp;#26102;&amp;#20505;&amp;#25165;&amp;#21487;&amp;#20197;&amp;#28023;&amp;#36873;&amp;#21602;&amp;#65311;&amp;#12290;&amp;#12290;&amp;#12290;&amp;#12290; 2010&amp;#24180;&amp;#30340;&amp;#22836;&amp;#19968;&amp;#26729;&amp;#22909;&amp;#20687;&amp;#23601;&amp;#26159;&amp;#25226;&amp;#36335;&amp;#32771;&amp;#36807;&amp;#20102;&amp;#65292;&amp;#24212;&amp;#35813;&amp;#24180;&amp;#21069;&amp;#23601;&amp;#33021;&amp;#25630;&amp;#23450;&amp;#20102;&amp;#21543;&amp;#12290;&amp;#37027;&amp;#25384;&amp;#30528;&amp;#30340;&amp;#23601;&amp;#26159;&amp;#24324;&amp;#20010;&amp;#36710;&amp;#24320;&amp;#19968;&amp;#36255;&amp;#33258;&amp;#39550;&amp;#28216;&amp;#12290;&amp;#24320;&amp;#28304;&amp;#19978;&amp;#38754;&amp;#24076;&amp;#26395;&amp;#33021;&amp;#36129;&amp;#29486;&amp;#26356;&amp;#22810;&amp;#65292;&amp;#22810;&amp;#23398;&amp;#23398;&amp;#33521;&amp;#35821;&amp;#65292;&amp;#20570;&amp;#20570;&amp;#32763;&amp;#35793;&amp;#65292;&amp;#21548;&amp;#21147;&amp;#21644;&amp;#21475;&amp;#35821;&amp;#33021;&amp;#36798;&amp;#21040;&amp;#21644;&amp;#20154;&amp;#20132;&amp;#27969;&amp;#23601;&amp;#22909;&amp;#20102;&amp;#65292;&amp;#35805;&amp;#35828;&amp;#65292;&amp;#26159;&amp;#19981;&amp;#26159;&amp;#24212;&amp;#35813;&amp;#25253;&amp;#20010;&amp;#29677;&amp;#21602;&amp;#65311;&amp;#12290;&amp;#12290;&amp;#12290; &amp;#34429;&amp;#28982;&amp;#26159;&amp;#20840;&amp;#38190;&amp;#30424;&amp;#65292;&amp;#25171;&amp;#23383;&amp;#20854;&amp;#23454;&amp;#36824;&amp;#26159;&amp;#27809;&amp;#30005;&amp;#33041;&amp;#29245;&amp;#65292;&amp;#21621;&amp;#21621;&amp;#12290;</description></item></channel></rss>