<?xml version="1.0" encoding="utf-8" standalone="yes"?><rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom"><channel><title>life on wd and cc</title><link>https://wdicc.com/tags/life/</link><description>Recent content in life on wd and cc</description><generator>Hugo -- gohugo.io</generator><language>zh-cn</language><lastBuildDate>Sat, 07 Oct 2017 18:10:00 +0800</lastBuildDate><atom:link href="https://wdicc.com/tags/life/atom.xml" rel="self" type="application/rss+xml"/><item><title>生生死死《白鹿原》</title><link>https://wdicc.com/life/</link><pubDate>Sat, 07 Oct 2017 18:10:00 +0800</pubDate><guid>https://wdicc.com/life/</guid><description> 之前 6 月份去上海那边的时候，偶尔看到电视里面演《白鹿原》，看了几集。吸引我的，主要可能是里面的乡土气息，以及里面的几个演员演的挺好的。那会看的好像是 40 多集，并且是断续看的，剧情也不太能接的上。后来回来后，找了一个时间，就从头开始看了。直到今天才算看完。看的时候实在是感慨良多，看完了也是心情不太能平复，稍微记录一下。因为没看过书，记录以电视剧剧情为主。 这剧从大清末年演到了 49 年建国后，基本是从白嘉轩娶媳妇开始讲到当了族长，到生儿育女，到孩子上学，闹革命，生孩子。到最后剧里面的人物死的死，老的老，实在是看的人很心酸。从一个上帝视角看了这么多人的生生死死，以后还是得少看这种剧了。 白嘉轩一辈子，挺直了腰杆做人，做事的是非对错不评价，但是确实是可以算是不愧对自己，家教很严，但是也就导致了服从家教的孩子们活的很是平淡，这个其实也就是白嘉轩的理念，踏实种个地抱个娃，平平安安一辈子，也就是了，这也是很多老普通百姓的理念。&amp;#34;房是招牌地是累，按下银钱是催命鬼&amp;#34;，这就是古人对普通人生活的建议。但是这么做就可以踏实一辈子么？可以看到白嘉轩的各种经历，清兵围城，闹土匪，镇嵩军征粮征税，天灾大旱，国民党共产党互相闹，这些事情，你不去惹，事情也会找上你。这是命不好？ 生活这一辈子就是个社交，免不了的要和其他人产生交集，矛盾就会出现，就会遇到问题。躲不掉。所谓你抗争是一辈子，认命也是一辈子，一辈子过去了也就是过去了，没有反悔的机会，不能重新来过。 鹿子霖从开头争抢族长，到后面坐牢看透人生，到后面老糊涂了，演的实在是很好。普通老百姓，有点小恶，顶多也就是占点小便宜，大恶也不敢，游说小蛾勾引白孝文成功之后，白嘉轩对孝文执行族法，是真的出来劝了，没想到这么严重。小老百姓占点便宜就回家高高兴兴的喝酒了。这人活的也很真实，那点小便宜也就是他的一点追求，能压倒族长一头，就觉得自己很有面子。反而白嘉轩那么大义，倒是有那么些不真实。 这剧里面两个最悲情的人物，一个是田小蛾，一个就是冷秋月。小蛾没啥别的追求，也就是想有个人能一起踏实过日子。所以黑娃和他住在破窑里面的时候是最开心的，管他其他那些呢，只要能一起好好过日子就可以了。但是可惜，有些事情看不透，参加农协搞事情，以为是好运来了，却没想到那是送命的前兆。以为黑娃死了之后，一个弱女人开始找自己的依靠，一半是为了报仇，一半是真心觉得白孝文对自己真好，开始了自己的第二次的幸福生活。却没想到，命丧在这里。死的很悲情，这也是炮灰，要不是鹿兆鹏拉拢，可能黑娃踏实的攒钱，种地养老婆，一辈子或许平平淡淡的，但是安安全全的就过去了。有欲望，就会被人利用，当然也可以说那是自己想做的，不是利用，但是在做之前有人告诉过后果么，知道了后果，还回去做么？当然，可能也没人能预料到那个后果，还是自己的选择。 传言鹿兆鹏死了的时候，秋月端着盆子给鹿子霖洗脚，说是代鹿兆鹏做这个事情，那个瞬间就泪崩了。秋月你可以说是死在封建社会下，但是鹿兆鹏也有不可原谅的责任。秋月开始可能真是按照父母之命嫁过去的，但是后面，某次对白里面也说了，那是真心喜欢兆鹏。就像兆海为了白灵终生未娶一样，秋月为了兆鹏也是守了一辈子的寡。鹿兆鹏说是为了他爷爷为了他爸，把人家娶回了家，又让人家守活寡，这个算是一个正确的价值观么？秋月出场之后一辈子，都踏踏实实的照顾兆鹏父母爷爷，为的就是哪天兆鹏可以多看她一眼，就连想要生一个孩子，也是为了说将来给兆鹏父母养老。等了一辈子，最后兆鹏回家说带她走的时候，本以为已经等到头了，结果发现兆鹏的方案还是继续让她守活寡，也就是这一刻，秋月可能才明白，兆鹏这辈子都不可能和她有什么交集了，自己守的这么一辈子，毫无意义，自杀也是她唯一的一个选择了。封建礼数是一半责任，鹿兆鹏本人也有一半责任。 鹿兆鹏和白嘉轩一样的不真实。 白灵这个演员确实有点嫩，但是也就是这样，估计才能演好年轻的时候。白灵有句话&amp;#34;我的眼睛睁开了，就不会再闭回去&amp;#34;，一个积极向上的乐观的年轻人，和命运做抗争，看过了各种生死之后，总算要过上安定日子了，死了。可能连自己的孩子都没见上几次。每次看到她，那种跳脱的状态很吸引人，不过也有人不喜欢她。 看剧的时候，说实话一直担心最后是一个大家都悲惨的结局，虽然知道这是演戏，但是还是希望能有点好的结局。剧里最后也算是一个还可以的结局了，如果把后面的大跃进灾年再写了，真就有点难看了。鹿家活了一个儿子还有孙女，白家活了一个儿子和孙子孙女。 其他人就不评论了，其实看的时候很多场景都有感触，但是也没记住那么多。看完之后还蛮有冲动再看一次的，但是剧集实在太长了，以后有时间看一下书吧，这个年代拍的电视剧，本身就有太多的忌讳，相信还是原著会更加精彩，而且初步估计，会感觉和电视剧是两个内容，呵呵。当年我高中的时候，拿到一本《平凡的世界》，那会简直就是一刻不停，连续看了几天把书看完了。现在不记得多少内容了，但是那会应该也是被书里描述的农村到城市的历程吸引了吧。现在看白鹿原，里面孩子们最后在县城省城工作，其实和现在的世道没个啥区别。而且其他的，比如这高房价物价，贪官私人关系，可能也可以类比。小老百姓真的可以踏实过日子么？ 踏实过日子，慢慢可能会让人把你玩死。另一个选择就是不甘于现状，当然也不一定求逆天改命，只求能在遇到事情的时候，能给自己多一些路。 现在年纪大了，确实很多事情慢慢在看透，40 不惑不是都看明白了，是看明白的也就明白了，没看明白的就不看了，所谓看透。这个年纪看这种讲人一生的戏，看到后面那么多的生死，和自己的现实一应证，实在是有点抗不住。人生一辈子，到底是为什么活呢？越来越迷茫了。所以这帖子的英文取名为 Life。</description></item><item><title>总结 2010</title><link>https://wdicc.com/days-in-2010/</link><pubDate>Sun, 13 Feb 2011 00:00:00 +0000</pubDate><guid>https://wdicc.com/days-in-2010/</guid><description>这都 2011 年的 2 月份了才写 2010 年的总结，好像晚了点，呵呵。不过其实这不是才过年了，还不算晚。
翻翻看 2009 年的，比对一下。 http://wdicc.com/2009/
写程序方面应该是更熟悉了，perl 里面的 pm 啥的也写了几个，甭管好不好用吧，反正是也算是用上了。另外就是 js 也写了不少，不过都是瞎写。
2010 年开年就不利，投资错误损失了 2 万多。换了工作，并有了第一辆车，在还没来得及开一个长途之前，车就又没了。还赶上悲催的北京限车令，现在还没的开。车没了也导致直接损失 1 万多，还好有保险。一年到头本来也没多少钱。
2010 还真有一次自驾游，去了平谷，庆祝刷版 10 周年，一帮人玩了两天。
开源上面好像没什么特别的贡献，自从用上 gentoo，懒的不行了。英语也没什么长进.... 2011 年努力吧。
2011 年希望能来一次远一点旅游，出国最好了。实在去不了，国内也行。这几年都没有出去玩过了。
2011 年也希望工作上面能有成就，每天上班的时候能有激情。</description></item><item><title>2009年的最后一天</title><link>https://wdicc.com/2009/</link><pubDate>Thu, 31 Dec 2009 00:00:00 +0000</pubDate><guid>https://wdicc.com/2009/</guid><description>&amp;#26368;&amp;#21518;&amp;#19968;&amp;#22825;&amp;#20102;&amp;#65292;&amp;#20284;&amp;#20046;&amp;#24212;&amp;#35813;&amp;#20889;&amp;#20010;&amp;#24635;&amp;#32467;&amp;#30340;&amp;#65292;&amp;#33293;&amp;#19981;&amp;#24471;&amp;#28909;&amp;#34987;&amp;#31389;&amp;#65292;&amp;#25163;&amp;#26426;&amp;#23558;&amp;#23601;&amp;#26469;&amp;#19968;&amp;#20010;&amp;#21543;&amp;#12290;
2009&amp;#24180;&amp;#24037;&amp;#20316;&amp;#19978;&amp;#38754;&amp;#22909;&amp;#20687;&amp;#27809;&amp;#20160;&amp;#20040;&amp;#22909;&amp;#35828;&amp;#30340;&amp;#65292;&amp;#21807;&amp;#19968;&amp;#30340;&amp;#36827;&amp;#27493;&amp;#21487;&amp;#33021;&amp;#36824;&amp;#26159;&amp;#20889;&amp;#31243;&amp;#24207;&amp;#22909;&amp;#20687;&amp;#26356;&amp;#29087;&amp;#20102;&amp;#28857;&amp;#20102;&amp;#65292;&amp;#20854;&amp;#23454;&amp;#20063;&amp;#23601;&amp;#26159;&amp;#35266;&amp;#25705;&amp;#20102;&amp;#19968;&amp;#20010;&amp;#39640;&amp;#25163;&amp;#30340;&amp;#31243;&amp;#24207;&amp;#65292;&amp;#26412;&amp;#36523;&amp;#38271;&amp;#36827;&amp;#36824;&amp;#26159;&amp;#19981;&amp;#22823;&amp;#12290;
&amp;#36890;&amp;#36807;&amp;#23545;&amp;#31038;&amp;#20250;&amp;#19978;&amp;#38754;&amp;#24694;&amp;#24515;&amp;#20107;&amp;#30340;&amp;#35266;&amp;#23519;&amp;#20102;&amp;#35299;&amp;#65292;&amp;#29616;&amp;#22312;&amp;#22909;&amp;#20687;&amp;#36234;&amp;#26469;&amp;#36234;&amp;#24868;&amp;#38738;&amp;#20102;&amp;#65292;&amp;#23545;&amp;#32463;&amp;#27982;&amp;#21644;&amp;#31038;&amp;#20250;&amp;#26041;&amp;#38754;&amp;#30340;&amp;#19996;&amp;#35199;&amp;#22909;&amp;#20687;&amp;#36234;&amp;#26469;&amp;#36234;&amp;#26377;&amp;#20852;&amp;#36259;&amp;#20102;&amp;#65292;&amp;#32769;&amp;#20102;&amp;#65311;&amp;#12290;&amp;#12290;&amp;#12290;&amp;#12290;&amp;#39034;&amp;#20415;&amp;#20877;&amp;#26174;&amp;#25670;&amp;#19968;&amp;#20010;&amp;#19978;&amp;#36807;&amp;#23398;&amp;#23601;&amp;#24212;&amp;#35813;&amp;#30693;&amp;#36947;&amp;#30340;&amp;#35789;&amp;ldquo;&amp;#22269;&amp;#23478;&amp;#22404;&amp;#26029;&amp;#36164;&amp;#26412;&amp;#20027;&amp;#20041;&amp;ldquo;&amp;#65292;&amp;#26377;&amp;#26102;&amp;#20505;&amp;#23601;&amp;#22312;&amp;#24819;&amp;#65292;&amp;#26159;&amp;#19981;&amp;#26159;&amp;#24212;&amp;#35813;&amp;#25226;&amp;#37027;&amp;#26412;&amp;#25919;&amp;#27835;&amp;#20070;&amp;#32763;&amp;#20986;&amp;#26469;&amp;#20877;&amp;#30475;&amp;#30475;&amp;#21602;&amp;#65311;&amp;#36164;&amp;#26412;&amp;#35770;&amp;#19981;&amp;#30693;&amp;#36947;&amp;#29616;&amp;#22312;&amp;#36807;&amp;#26399;&amp;#19981;&amp;#12290;&amp;#12290;&amp;#12290;&amp;#20102;&amp;#35299;&amp;#37027;&amp;#20123;&amp;#20498;&amp;#19981;&amp;#19968;&amp;#23450;&amp;#26159;&amp;#21435;&amp;#24403;&amp;#20154;&amp;#22823;&amp;#20195;&amp;#34920;&amp;#65292;&amp;#21482;&amp;#26159;&amp;#33021;&amp;#35753;&amp;#33258;&amp;#24049;&amp;#33021;&amp;#25226;&amp;#36825;&amp;#20010;&amp;#31038;&amp;#20250;&amp;#36825;&amp;#20010;&amp;#22269;&amp;#23478;&amp;#30475;&amp;#30340;&amp;#26356;&amp;#21152;&amp;#36879;&amp;#24443;&amp;#19968;&amp;#28857;&amp;#12290;&amp;#19981;&amp;#36807;&amp;#35805;&amp;#35828;&amp;#22238;&amp;#26469;&amp;#65292;&amp;#20154;&amp;#22823;&amp;#20195;&amp;#34920;&amp;#20160;&amp;#20040;&amp;#26102;&amp;#20505;&amp;#25165;&amp;#21487;&amp;#20197;&amp;#28023;&amp;#36873;&amp;#21602;&amp;#65311;&amp;#12290;&amp;#12290;&amp;#12290;&amp;#12290;
2010&amp;#24180;&amp;#30340;&amp;#22836;&amp;#19968;&amp;#26729;&amp;#22909;&amp;#20687;&amp;#23601;&amp;#26159;&amp;#25226;&amp;#36335;&amp;#32771;&amp;#36807;&amp;#20102;&amp;#65292;&amp;#24212;&amp;#35813;&amp;#24180;&amp;#21069;&amp;#23601;&amp;#33021;&amp;#25630;&amp;#23450;&amp;#20102;&amp;#21543;&amp;#12290;&amp;#37027;&amp;#25384;&amp;#30528;&amp;#30340;&amp;#23601;&amp;#26159;&amp;#24324;&amp;#20010;&amp;#36710;&amp;#24320;&amp;#19968;&amp;#36255;&amp;#33258;&amp;#39550;&amp;#28216;&amp;#12290;&amp;#24320;&amp;#28304;&amp;#19978;&amp;#38754;&amp;#24076;&amp;#26395;&amp;#33021;&amp;#36129;&amp;#29486;&amp;#26356;&amp;#22810;&amp;#65292;&amp;#22810;&amp;#23398;&amp;#23398;&amp;#33521;&amp;#35821;&amp;#65292;&amp;#20570;&amp;#20570;&amp;#32763;&amp;#35793;&amp;#65292;&amp;#21548;&amp;#21147;&amp;#21644;&amp;#21475;&amp;#35821;&amp;#33021;&amp;#36798;&amp;#21040;&amp;#21644;&amp;#20154;&amp;#20132;&amp;#27969;&amp;#23601;&amp;#22909;&amp;#20102;&amp;#65292;&amp;#35805;&amp;#35828;&amp;#65292;&amp;#26159;&amp;#19981;&amp;#26159;&amp;#24212;&amp;#35813;&amp;#25253;&amp;#20010;&amp;#29677;&amp;#21602;&amp;#65311;&amp;#12290;&amp;#12290;&amp;#12290;
&amp;#34429;&amp;#28982;&amp;#26159;&amp;#20840;&amp;#38190;&amp;#30424;&amp;#65292;&amp;#25171;&amp;#23383;&amp;#20854;&amp;#23454;&amp;#36824;&amp;#26159;&amp;#27809;&amp;#30005;&amp;#33041;&amp;#29245;&amp;#65292;&amp;#21621;&amp;#21621;&amp;#12290;</description></item></channel></rss>