<?xml version="1.0" encoding="utf-8" standalone="yes"?><rss version="2.0" xmlns:atom="http://www.w3.org/2005/Atom"><channel><title>Work on wd and cc</title><link>https://wdicc.com/tags/work/</link><description>Recent content in Work on wd and cc</description><generator>Hugo</generator><language>en</language><copyright>wd © 2025</copyright><lastBuildDate>Tue, 17 Jun 2025 08:30:20 -0700</lastBuildDate><atom:link href="https://wdicc.com/tags/work/atom.xml" rel="self" type="application/rss+xml"/><item><title>In the US</title><link>https://wdicc.com/in-the-us/</link><pubDate>Tue, 17 Jun 2025 08:30:20 -0700</pubDate><guid>https://wdicc.com/in-the-us/</guid><description>&lt;p&gt;2025.1 举家 relocate 到了美国。到现在快半年了。记录一下这边的见闻。&lt;/p&gt;
&lt;div id="outline-container-headline-1" class="outline-3"&gt;
&lt;h3 id="headline-1"&gt;
很多东西都比较大
&lt;/h3&gt;
&lt;div id="outline-text-headline-1" class="outline-text-3"&gt;
&lt;p&gt;刚来的时候租车特意没选特别大的那种车，因为怕停车什么的不方便。结果出去几次就发现，他们这边的车位都奇大一个，甚至都不用倒车入库，直接头就可以进去，因为地方很大。他们这里驾照考试也没有要求说需要会倒车入库。我比较怀疑很多人可能根本就不会倒车入库。我开一个 suv，在路上有时候还会遇到那种高出我的车好多的车。这样的车都可以正常停车。&lt;/p&gt;</description></item><item><title>Expand Yourself</title><link>https://wdicc.com/expand-yourself/</link><pubDate>Sun, 26 Dec 2021 11:09:15 +0800</pubDate><guid>https://wdicc.com/expand-yourself/</guid><description>&lt;p&gt;刚开始工作的时候，一个常见的话题就是自己遇到领导或者老板好不好。什么是好领导或者好老板呢？平时什么都不管你，你想干什么就干什么这种？还是你做的任何事情都过问，细节也不放过，对你做的这些都要把控？也可能是上面两种的综合？&lt;/p&gt;</description></item><item><title>总结 2010</title><link>https://wdicc.com/days-in-2010/</link><pubDate>Sun, 13 Feb 2011 00:00:00 +0000</pubDate><guid>https://wdicc.com/days-in-2010/</guid><description>这都 2011 年的 2 月份了才写 2010 年的总结，好像晚了点，呵呵。不过其实这不是才过年了，还不算晚。&lt;br /&gt;

翻翻看 2009 年的，比对一下。 http://wdicc.com/2009/&lt;br /&gt;

写程序方面应该是更熟悉了，perl 里面的 pm 啥的也写了几个，甭管好不好用吧，反正是也算是用上了。另外就是 js 也写了不少，不过都是瞎写。&lt;br /&gt;

2010 年开年就不利，投资错误损失了 2 万多。换了工作，并有了第一辆车，在还没来得及开一个长途之前，车就又没了。还赶上悲催的北京限车令，现在还没的开。车没了也导致直接损失 1 万多，还好有保险。一年到头本来也没多少钱。&lt;br /&gt;

2010 还真有一次自驾游，去了平谷，庆祝刷版 10 周年，一帮人玩了两天。&lt;br /&gt;

开源上面好像没什么特别的贡献，自从用上 gentoo，懒的不行了。英语也没什么长进.... 2011 年努力吧。&lt;br /&gt;

2011 年希望能来一次远一点旅游，出国最好了。实在去不了，国内也行。这几年都没有出去玩过了。&lt;br /&gt;

2011 年也希望工作上面能有成就，每天上班的时候能有激情。&lt;br /&gt;</description></item><item><title>2009年的最后一天</title><link>https://wdicc.com/2009/</link><pubDate>Thu, 31 Dec 2009 00:00:00 +0000</pubDate><guid>https://wdicc.com/2009/</guid><description>&amp;#26368;&amp;#21518;&amp;#19968;&amp;#22825;&amp;#20102;&amp;#65292;&amp;#20284;&amp;#20046;&amp;#24212;&amp;#35813;&amp;#20889;&amp;#20010;&amp;#24635;&amp;#32467;&amp;#30340;&amp;#65292;&amp;#33293;&amp;#19981;&amp;#24471;&amp;#28909;&amp;#34987;&amp;#31389;&amp;#65292;&amp;#25163;&amp;#26426;&amp;#23558;&amp;#23601;&amp;#26469;&amp;#19968;&amp;#20010;&amp;#21543;&amp;#12290;&lt;br /&gt;

2009&amp;#24180;&amp;#24037;&amp;#20316;&amp;#19978;&amp;#38754;&amp;#22909;&amp;#20687;&amp;#27809;&amp;#20160;&amp;#20040;&amp;#22909;&amp;#35828;&amp;#30340;&amp;#65292;&amp;#21807;&amp;#19968;&amp;#30340;&amp;#36827;&amp;#27493;&amp;#21487;&amp;#33021;&amp;#36824;&amp;#26159;&amp;#20889;&amp;#31243;&amp;#24207;&amp;#22909;&amp;#20687;&amp;#26356;&amp;#29087;&amp;#20102;&amp;#28857;&amp;#20102;&amp;#65292;&amp;#20854;&amp;#23454;&amp;#20063;&amp;#23601;&amp;#26159;&amp;#35266;&amp;#25705;&amp;#20102;&amp;#19968;&amp;#20010;&amp;#39640;&amp;#25163;&amp;#30340;&amp;#31243;&amp;#24207;&amp;#65292;&amp;#26412;&amp;#36523;&amp;#38271;&amp;#36827;&amp;#36824;&amp;#26159;&amp;#19981;&amp;#22823;&amp;#12290;&lt;br /&gt;

&amp;#36890;&amp;#36807;&amp;#23545;&amp;#31038;&amp;#20250;&amp;#19978;&amp;#38754;&amp;#24694;&amp;#24515;&amp;#20107;&amp;#30340;&amp;#35266;&amp;#23519;&amp;#20102;&amp;#35299;&amp;#65292;&amp;#29616;&amp;#22312;&amp;#22909;&amp;#20687;&amp;#36234;&amp;#26469;&amp;#36234;&amp;#24868;&amp;#38738;&amp;#20102;&amp;#65292;&amp;#23545;&amp;#32463;&amp;#27982;&amp;#21644;&amp;#31038;&amp;#20250;&amp;#26041;&amp;#38754;&amp;#30340;&amp;#19996;&amp;#35199;&amp;#22909;&amp;#20687;&amp;#36234;&amp;#26469;&amp;#36234;&amp;#26377;&amp;#20852;&amp;#36259;&amp;#20102;&amp;#65292;&amp;#32769;&amp;#20102;&amp;#65311;&amp;#12290;&amp;#12290;&amp;#12290;&amp;#12290;&amp;#39034;&amp;#20415;&amp;#20877;&amp;#26174;&amp;#25670;&amp;#19968;&amp;#20010;&amp;#19978;&amp;#36807;&amp;#23398;&amp;#23601;&amp;#24212;&amp;#35813;&amp;#30693;&amp;#36947;&amp;#30340;&amp;#35789;&amp;ldquo;&amp;#22269;&amp;#23478;&amp;#22404;&amp;#26029;&amp;#36164;&amp;#26412;&amp;#20027;&amp;#20041;&amp;ldquo;&amp;#65292;&amp;#26377;&amp;#26102;&amp;#20505;&amp;#23601;&amp;#22312;&amp;#24819;&amp;#65292;&amp;#26159;&amp;#19981;&amp;#26159;&amp;#24212;&amp;#35813;&amp;#25226;&amp;#37027;&amp;#26412;&amp;#25919;&amp;#27835;&amp;#20070;&amp;#32763;&amp;#20986;&amp;#26469;&amp;#20877;&amp;#30475;&amp;#30475;&amp;#21602;&amp;#65311;&amp;#36164;&amp;#26412;&amp;#35770;&amp;#19981;&amp;#30693;&amp;#36947;&amp;#29616;&amp;#22312;&amp;#36807;&amp;#26399;&amp;#19981;&amp;#12290;&amp;#12290;&amp;#12290;&amp;#20102;&amp;#35299;&amp;#37027;&amp;#20123;&amp;#20498;&amp;#19981;&amp;#19968;&amp;#23450;&amp;#26159;&amp;#21435;&amp;#24403;&amp;#20154;&amp;#22823;&amp;#20195;&amp;#34920;&amp;#65292;&amp;#21482;&amp;#26159;&amp;#33021;&amp;#35753;&amp;#33258;&amp;#24049;&amp;#33021;&amp;#25226;&amp;#36825;&amp;#20010;&amp;#31038;&amp;#20250;&amp;#36825;&amp;#20010;&amp;#22269;&amp;#23478;&amp;#30475;&amp;#30340;&amp;#26356;&amp;#21152;&amp;#36879;&amp;#24443;&amp;#19968;&amp;#28857;&amp;#12290;&amp;#19981;&amp;#36807;&amp;#35805;&amp;#35828;&amp;#22238;&amp;#26469;&amp;#65292;&amp;#20154;&amp;#22823;&amp;#20195;&amp;#34920;&amp;#20160;&amp;#20040;&amp;#26102;&amp;#20505;&amp;#25165;&amp;#21487;&amp;#20197;&amp;#28023;&amp;#36873;&amp;#21602;&amp;#65311;&amp;#12290;&amp;#12290;&amp;#12290;&amp;#12290;&lt;br /&gt;

2010&amp;#24180;&amp;#30340;&amp;#22836;&amp;#19968;&amp;#26729;&amp;#22909;&amp;#20687;&amp;#23601;&amp;#26159;&amp;#25226;&amp;#36335;&amp;#32771;&amp;#36807;&amp;#20102;&amp;#65292;&amp;#24212;&amp;#35813;&amp;#24180;&amp;#21069;&amp;#23601;&amp;#33021;&amp;#25630;&amp;#23450;&amp;#20102;&amp;#21543;&amp;#12290;&amp;#37027;&amp;#25384;&amp;#30528;&amp;#30340;&amp;#23601;&amp;#26159;&amp;#24324;&amp;#20010;&amp;#36710;&amp;#24320;&amp;#19968;&amp;#36255;&amp;#33258;&amp;#39550;&amp;#28216;&amp;#12290;&amp;#24320;&amp;#28304;&amp;#19978;&amp;#38754;&amp;#24076;&amp;#26395;&amp;#33021;&amp;#36129;&amp;#29486;&amp;#26356;&amp;#22810;&amp;#65292;&amp;#22810;&amp;#23398;&amp;#23398;&amp;#33521;&amp;#35821;&amp;#65292;&amp;#20570;&amp;#20570;&amp;#32763;&amp;#35793;&amp;#65292;&amp;#21548;&amp;#21147;&amp;#21644;&amp;#21475;&amp;#35821;&amp;#33021;&amp;#36798;&amp;#21040;&amp;#21644;&amp;#20154;&amp;#20132;&amp;#27969;&amp;#23601;&amp;#22909;&amp;#20102;&amp;#65292;&amp;#35805;&amp;#35828;&amp;#65292;&amp;#26159;&amp;#19981;&amp;#26159;&amp;#24212;&amp;#35813;&amp;#25253;&amp;#20010;&amp;#29677;&amp;#21602;&amp;#65311;&amp;#12290;&amp;#12290;&amp;#12290;&lt;br /&gt;

&amp;#34429;&amp;#28982;&amp;#26159;&amp;#20840;&amp;#38190;&amp;#30424;&amp;#65292;&amp;#25171;&amp;#23383;&amp;#20854;&amp;#23454;&amp;#36824;&amp;#26159;&amp;#27809;&amp;#30005;&amp;#33041;&amp;#29245;&amp;#65292;&amp;#21621;&amp;#21621;&amp;#12290;&lt;br /&gt;</description></item><item><title>好久好久没有更新blog了</title><link>https://wdicc.com/long-time-havent-update-blog/</link><pubDate>Sun, 18 Nov 2007 00:00:00 +0000</pubDate><guid>https://wdicc.com/long-time-havent-update-blog/</guid><description>挺长时间了好像。上班的时候没时间来写，下了班回家又懒得写，有时间去看连续剧了。《越狱》第三季确实没什么好看的，scofiled 完全没有第一季那种感觉，一切都在自己的掌握中。不过将就看了。《heroes》还算好看，不过里面有超能力的人也太多了吧，真像谁说的来着，在那里面，没有超能力都不好意思和人打招呼。现在看这个片子感觉就是在关注什么新的超能力被发现，还有超能力大战了。另外美剧好像都喜欢弄一个很大的后台，叫做company，一波一波的人都为这个公司干活，而且这个公司几乎是无所不能。&lt;br /&gt;

昨天老婆给买了一个羽绒服，挺好看，穿着舒服，哈哈。现在买衣服基本什么都不管了，老婆逛街的时候给捎带上就行，呵呵。 嗯，这是有老婆的一个好处。 :D&lt;br /&gt;

最近还在写一个perl的脚本。按照计划下周应该完工了。perl的cpan还是很强大的，不过perl的oo感觉没有python好，python的缩进有时候却又让人头疼，呵呵。可惜我们这边python好像不怎么吃香，大家还都停留在perl。php，perl都得会呀，虽然我现在只懂毛皮。&lt;br /&gt;</description></item></channel></rss>